content/man/man1/bluetoothctl-mgmt.1.org
#+TITLE: Manpages - bluetoothctl-mgmt.1
* NAME
bluetoothctl-mgmt - Management Submenu

* SYNOPSIS
*bluetoothctl* [--options] [mgmt.commands]

* MGMT COMMANDS
** select
Select a different index

#+begin_quote
- *Usage* :: *# select <index>*

#+end_quote

** revision
Get the MGMT Revision

#+begin_quote
- *Usage* :: *# revision*

#+end_quote

** commands
List supported commands

#+begin_quote
- *Usage* :: *# commands*

#+end_quote

** config
Show configuration info

#+begin_quote
- *Usage* :: *# config*

#+end_quote

** info
Show controller info

#+begin_quote
- *Usage* :: *# info*

#+end_quote

** extinfo
Show extended controller info

#+begin_quote
- *Usage* :: *# extinfo*

#+end_quote

** auto-power
Power all available features

#+begin_quote
- *Usage* :: *# auto-power*

#+end_quote

** power
Toggle powered state

#+begin_quote
- *Usage* :: *# power <on/off>*

#+end_quote

** discov
Toggle discoverable state

#+begin_quote
- *Usage* :: *# discov <yes/no/limited> [timeout]*

#+end_quote

** connectable
Toggle connectable state

#+begin_quote
- *Usage* :: *# connectable <on/off>*

#+end_quote

** fast-conn
Toggle fast connectable state

#+begin_quote
- *Usage* :: *# fast-conn <on/off>*

#+end_quote

** bondable
Toggle bondable state

#+begin_quote
- *Usage* :: *# bondable <on/off>*

#+end_quote

** pairable
Toggle bondable state

#+begin_quote
- *Usage* :: *# pairable <on/off>*

#+end_quote

** linksec
Toggle link level security

#+begin_quote
- *Usage* :: *# linksec <on/off>*

#+end_quote

** ssp
Toggle SSP mode

#+begin_quote
- *Usage* :: *# spp <on/off>*

#+end_quote

** sc
Toggle SC support

#+begin_quote
- *Usage* :: *# sc <on/off/only>*

#+end_quote

** hs
Toggle HS support

#+begin_quote
- *Usage* :: *# hs <on/off>*

#+end_quote

** le
Toggle LE support

#+begin_quote
- *Usage* :: *# le <on/off>*

#+end_quote

** advertising
Toggle LE advertising

#+begin_quote
- *Usage* :: *# advertise <on/off>*

#+end_quote

** bredr
Toggle BR/EDR support

#+begin_quote
- *Usage* :: *# bredr <on/off>*

#+end_quote

** privacy
Toggle privacy support

#+begin_quote
- *Usage* :: *# privacy <on/off> [irk]*

#+end_quote

** class
Set device major/minor class

#+begin_quote
- *Usage* :: *# class <major> <minor>*

#+end_quote

** disconnect
Disconnect device

#+begin_quote
- *Usage* :: *# disconnect [-t type] <remote address>*

#+end_quote

** con
List connections

#+begin_quote
- *Usage* :: *# con*

#+end_quote

** find
Discover nearby devices

#+begin_quote
- *Usage* :: *# find [-l|-b] [-L]*

#+end_quote

** find-service
Discover nearby service

#+begin_quote
- *Usage* :: *# find-service [-u UUID] [-r RSSI_Threshold] [-l|-b]*

#+end_quote

** stop-find
Stop discovery

#+begin_quote
- *Usage* :: *# stop-find [-l|-b]*

#+end_quote

** name
Set local name

#+begin_quote
- *Usage* :: *# name <name> [shortname]*

#+end_quote

** pair
Pair with a remote device

#+begin_quote
- *Usage* :: *# pair [-c cap] [-t type] <remote address>*

#+end_quote

** cancelpair
Cancel pairing

#+begin_quote
- *Usage* :: *# cancelpair [-t type] <remote address>*

#+end_quote

** unpair
Unpair device

#+begin_quote
- *Usage* :: *# unpair [-t type] <remote address>*

#+end_quote

** keys
Load Link Keys

#+begin_quote
- *Usage* :: *keys*

#+end_quote

** ltks
Load Long Term Keys

#+begin_quote
- *Usage* :: *# ltks*

#+end_quote

** irks
Load Identity Resolving Keys

#+begin_quote
- *Usage* :: *# irks [--local index] [--file file path]*

#+end_quote

