public/man/man1/bluetoothctl-mgmt.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - bluetoothctl-mgmt.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - bluetoothctl-mgmt.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>bluetoothctl-mgmt - Management Submenu</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>bluetoothctl</strong> [–options] [mgmt.commands]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
MGMT COMMANDS
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
select
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>Select a different index</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># select &lt;index&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
revision
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Get the MGMT Revision</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># revision</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
commands
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>List supported commands</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># commands</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
config
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Show configuration info</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># config</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
info
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Show controller info</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># info</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
extinfo
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>Show extended controller info</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># extinfo</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
auto-power
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>Power all available features</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># auto-power</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
power
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>Toggle powered state</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># power &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
discov
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>Toggle discoverable state</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># discov &lt;yes/no/limited&gt; [timeout]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
connectable
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>Toggle connectable state</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># connectable &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
fast-conn
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>Toggle fast connectable state</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># fast-conn &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
bondable
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>Toggle bondable state</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># bondable &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
pairable
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>Toggle bondable state</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># pairable &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
linksec
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<p>Toggle link level security</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># linksec &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
ssp
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>Toggle SSP mode</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># spp &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-19" class="outline-3">
<h3 id="headline-19">
sc
</h3>
<div id="outline-text-headline-19" class="outline-text-3">
<p>Toggle SC support</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># sc &lt;on/off/only&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
hs
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<p>Toggle HS support</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># hs &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
le
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>Toggle LE support</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># le &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-22" class="outline-3">
<h3 id="headline-22">
advertising
</h3>
<div id="outline-text-headline-22" class="outline-text-3">
<p>Toggle LE advertising</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># advertise &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-23" class="outline-3">
<h3 id="headline-23">
bredr
</h3>
<div id="outline-text-headline-23" class="outline-text-3">
<p>Toggle BR/EDR support</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># bredr &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-24" class="outline-3">
<h3 id="headline-24">
privacy
</h3>
<div id="outline-text-headline-24" class="outline-text-3">
<p>Toggle privacy support</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># privacy &lt;on/off&gt; [irk]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-25" class="outline-3">
<h3 id="headline-25">
class
</h3>
<div id="outline-text-headline-25" class="outline-text-3">
<p>Set device major/minor class</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># class &lt;major&gt; &lt;minor&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-26" class="outline-3">
<h3 id="headline-26">
disconnect
</h3>
<div id="outline-text-headline-26" class="outline-text-3">
<p>Disconnect device</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># disconnect [-t type] &lt;remote address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-27" class="outline-3">
<h3 id="headline-27">
con
</h3>
<div id="outline-text-headline-27" class="outline-text-3">
<p>List connections</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># con</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-28" class="outline-3">
<h3 id="headline-28">
find
</h3>
<div id="outline-text-headline-28" class="outline-text-3">
<p>Discover nearby devices</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># find [-l|-b] [-L]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-29" class="outline-3">
<h3 id="headline-29">
find-service
</h3>
<div id="outline-text-headline-29" class="outline-text-3">
<p>Discover nearby service</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># find-service [-u UUID] [-r RSSI_Threshold] [-l|-b]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-30" class="outline-3">
<h3 id="headline-30">
stop-find
</h3>
<div id="outline-text-headline-30" class="outline-text-3">
<p>Stop discovery</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># stop-find [-l|-b]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-31" class="outline-3">
<h3 id="headline-31">
name
</h3>
<div id="outline-text-headline-31" class="outline-text-3">
<p>Set local name</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># name &lt;name&gt; [shortname]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-32" class="outline-3">
<h3 id="headline-32">
pair
</h3>
<div id="outline-text-headline-32" class="outline-text-3">
<p>Pair with a remote device</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># pair [-c cap] [-t type] &lt;remote address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-33" class="outline-3">
<h3 id="headline-33">
cancelpair
</h3>
<div id="outline-text-headline-33" class="outline-text-3">
<p>Cancel pairing</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># cancelpair [-t type] &lt;remote address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-34" class="outline-3">
<h3 id="headline-34">
unpair
</h3>
<div id="outline-text-headline-34" class="outline-text-3">
<p>Unpair device</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># unpair [-t type] &lt;remote address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-35" class="outline-3">
<h3 id="headline-35">
keys
</h3>
<div id="outline-text-headline-35" class="outline-text-3">
<p>Load Link Keys</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong>keys</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-36" class="outline-3">
<h3 id="headline-36">
ltks
</h3>
<div id="outline-text-headline-36" class="outline-text-3">
<p>Load Long Term Keys</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># ltks</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-37" class="outline-3">
<h3 id="headline-37">
irks
</h3>
<div id="outline-text-headline-37" class="outline-text-3">
<p>Load Identity Resolving Keys</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># irks [–local index] [–file file path]</strong></dd>
</dl>
</blockquote>
</div>
</div>
