content/man/man1/bluetoothctl-mgmt.1.org
** block
Block Device

#+begin_quote
- *Usage* :: *# block [-t type] <remote address>*

#+end_quote

** unblock
Unblock Device

#+begin_quote
- *Usage* :: *# unblock [-t type] <remote address>*

#+end_quote

** add-uuid
Add UUID

#+begin_quote
- *Usage* :: *# add-uuid <UUID> <service class hint>*

#+end_quote

** rm-uuid
Remove UUID

#+begin_quote
- *Usage* :: *# rm-uuid <UUID>*

#+end_quote

** clr-uuids
Clear UUIDs

#+begin_quote
- *Usage* :: *# clear-uuids*

#+end_quote

** local-oob
Local OOB data

#+begin_quote
- *Usage* :: *# local-oob*

#+end_quote

** remote-oob
Remote OOB data

#+begin_quote
- *Usage* :: *# remote-oob [-t <addr_type>] [-r <rand192>] [-h
  <hash192>]* [-R <rand256>] [-H <hash256>] <addr>

#+end_quote

** did
Set Device ID

#+begin_quote
- *Usage* :: *# did <source>:<vendor>:<product>:<version>*

#+end_quote

** static-addr
Set static address

#+begin_quote
- *Usage* :: *# static-addr <address>*

#+end_quote

** public-addr
Set public address

#+begin_quote
- *Usage* :: *# public-addr <address>*

#+end_quote

** ext-config
External configuration

#+begin_quote
- *Usage* :: *# ext-config <on/off>*

#+end_quote

** debug-keys
Toggle debug keys

#+begin_quote
- *Usage* :: *# debug-keys <on/off>*

#+end_quote

** conn-info
Get connection information

#+begin_quote
- *Usage* :: *# conn-info [-t type] <remote address>*

#+end_quote

** io-cap
Set IO Capability

#+begin_quote
- *Usage* :: *# io-cap <cap>*

#+end_quote

** scan-params
Set Scan Parameters

#+begin_quote
- *Usage* :: *# scan-params <interval> <window>*

#+end_quote

** get-clock
Get Clock Information

#+begin_quote
- *Usage* :: *# get-clock [address]*

#+end_quote

** add-device
Add Device

#+begin_quote
- *Usage* :: *# add-device [-a action] [-t type] <address>*

#+end_quote

** del-device
Remove Device

#+begin_quote
- *Usage* :: *# del-device [-t type] <address>*

#+end_quote

** clr-devices
Clear Devices

#+begin_quote
- *Usage* :: *# clr-devices*

#+end_quote

** bredr-oob
Local OOB data (BR/EDR)

#+begin_quote
- *Usage* :: *# bredr-oob*

#+end_quote

** le-oob
Local OOB data (LE)

#+begin_quote
- *Usage* :: *# le-oob*

#+end_quote

** advinfo
Show advertising features

#+begin_quote
- *Usage* :: *# advinfo*

#+end_quote

** advsize
Show advertising size info

#+begin_quote
- *Usage* :: *# advsize [options] <instance_id>*

#+end_quote

** add-adv
Add advertising instance

#+begin_quote
- *Usage* :: *# add-adv [options] <instance_id>*

#+end_quote

** rm-adv
Remove advertising instance

#+begin_quote
- *Usage* :: *# rm-adv <instance_id>*

#+end_quote

** clr-adv
Clear advertising instances

#+begin_quote
- *Usage* :: *# clr-adv*

#+end_quote

** add-ext-adv-params
Add extended advertising params

#+begin_quote
- *Usage* :: *# add-ext-adv-parms [options] <instance_id>*

#+end_quote

** add-ext-adv-data
Add extended advertising data

#+begin_quote
- *Usage* :: *# add-ext-adv-data [options] <instance_id>*

#+end_quote

** appearance
Set appearance

#+begin_quote
- *Usage* :: *# appearance <appearance>*

#+end_quote

** phy
Get/Set PHY Configuration

#+begin_quote
- *Usage* :: *# phy [LE1MTX] [LE1MRX] [LE2MTX] [LE2MRX] [LECODEDTX]
  [LECODEDRX]* [BR1M1SLOT] [BR1M3SLOT] [BR1M5SLOT][EDR2M1SLOT]
  [EDR2M3SLOT] [EDR2M5SLOT][EDR3M1SLOT] [EDR3M3SLOT] [EDR3M5SLOT]

#+end_quote

** wbs
Toggle Wideband-Speech support

#+begin_quote
- *Usage* :: *# wbs <on/off>*

#+end_quote

** secinfo
Show security information

#+begin_quote
- *Usage* :: *# secinfo*

#+end_quote

** expinfo
Show experimental features

#+begin_quote
- *Usage* :: *# expinfo*

#+end_quote

** exp-debug
Set debug feature

#+begin_quote
- *Usage* :: *# exp-debug <on/off>*

#+end_quote

** exp-privacy
Set LL privacy feature

#+begin_quote
- *Usage* :: *# exp-privacy <on/off>*

#+end_quote

** exp-quality
Set bluetooth quality report feature

#+begin_quote
- *Usage* :: *# exp-quality <on/off>*

#+end_quote

