public/man/man1/bluetoothctl-mgmt.1/index.html
<div id="outline-container-headline-38" class="outline-3">
<h3 id="headline-38">
block
</h3>
<div id="outline-text-headline-38" class="outline-text-3">
<p>Block Device</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># block [-t type] &lt;remote address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-39" class="outline-3">
<h3 id="headline-39">
unblock
</h3>
<div id="outline-text-headline-39" class="outline-text-3">
<p>Unblock Device</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># unblock [-t type] &lt;remote address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-40" class="outline-3">
<h3 id="headline-40">
add-uuid
</h3>
<div id="outline-text-headline-40" class="outline-text-3">
<p>Add UUID</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># add-uuid &lt;UUID&gt; &lt;service class hint&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-41" class="outline-3">
<h3 id="headline-41">
rm-uuid
</h3>
<div id="outline-text-headline-41" class="outline-text-3">
<p>Remove UUID</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># rm-uuid &lt;UUID&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-42" class="outline-3">
<h3 id="headline-42">
clr-uuids
</h3>
<div id="outline-text-headline-42" class="outline-text-3">
<p>Clear UUIDs</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># clear-uuids</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-43" class="outline-3">
<h3 id="headline-43">
local-oob
</h3>
<div id="outline-text-headline-43" class="outline-text-3">
<p>Local OOB data</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># local-oob</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-44" class="outline-3">
<h3 id="headline-44">
remote-oob
</h3>
<div id="outline-text-headline-44" class="outline-text-3">
<p>Remote OOB data</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># remote-oob [-t &lt;addr_type&gt;] [-r &lt;rand192&gt;] [-h
&lt;hash192&gt;]</strong> [-R &lt;rand256&gt;] [-H &lt;hash256&gt;] &lt;addr&gt;</dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-45" class="outline-3">
<h3 id="headline-45">
did
</h3>
<div id="outline-text-headline-45" class="outline-text-3">
<p>Set Device ID</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># did &lt;source&gt;:&lt;vendor&gt;:&lt;product&gt;:&lt;version&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-46" class="outline-3">
<h3 id="headline-46">
static-addr
</h3>
<div id="outline-text-headline-46" class="outline-text-3">
<p>Set static address</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># static-addr &lt;address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-47" class="outline-3">
<h3 id="headline-47">
public-addr
</h3>
<div id="outline-text-headline-47" class="outline-text-3">
<p>Set public address</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># public-addr &lt;address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-48" class="outline-3">
<h3 id="headline-48">
ext-config
</h3>
<div id="outline-text-headline-48" class="outline-text-3">
<p>External configuration</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># ext-config &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-49" class="outline-3">
<h3 id="headline-49">
debug-keys
</h3>
<div id="outline-text-headline-49" class="outline-text-3">
<p>Toggle debug keys</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># debug-keys &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-50" class="outline-3">
<h3 id="headline-50">
conn-info
</h3>
<div id="outline-text-headline-50" class="outline-text-3">
<p>Get connection information</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># conn-info [-t type] &lt;remote address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-51" class="outline-3">
<h3 id="headline-51">
io-cap
</h3>
<div id="outline-text-headline-51" class="outline-text-3">
<p>Set IO Capability</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># io-cap &lt;cap&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-52" class="outline-3">
<h3 id="headline-52">
scan-params
</h3>
<div id="outline-text-headline-52" class="outline-text-3">
<p>Set Scan Parameters</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># scan-params &lt;interval&gt; &lt;window&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-53" class="outline-3">
<h3 id="headline-53">
get-clock
</h3>
<div id="outline-text-headline-53" class="outline-text-3">
<p>Get Clock Information</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># get-clock [address]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-54" class="outline-3">
<h3 id="headline-54">
add-device
</h3>
<div id="outline-text-headline-54" class="outline-text-3">
<p>Add Device</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># add-device [-a action] [-t type] &lt;address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-55" class="outline-3">
<h3 id="headline-55">
del-device
</h3>
<div id="outline-text-headline-55" class="outline-text-3">
<p>Remove Device</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># del-device [-t type] &lt;address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-56" class="outline-3">
<h3 id="headline-56">
clr-devices
</h3>
<div id="outline-text-headline-56" class="outline-text-3">
<p>Clear Devices</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># clr-devices</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-57" class="outline-3">
<h3 id="headline-57">
bredr-oob
</h3>
<div id="outline-text-headline-57" class="outline-text-3">
<p>Local OOB data (BR/EDR)</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># bredr-oob</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-58" class="outline-3">
<h3 id="headline-58">
le-oob
</h3>
<div id="outline-text-headline-58" class="outline-text-3">
<p>Local OOB data (LE)</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># le-oob</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-59" class="outline-3">
<h3 id="headline-59">
advinfo
</h3>
<div id="outline-text-headline-59" class="outline-text-3">
<p>Show advertising features</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># advinfo</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-60" class="outline-3">
<h3 id="headline-60">
advsize
</h3>
<div id="outline-text-headline-60" class="outline-text-3">
<p>Show advertising size info</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># advsize [options] &lt;instance_id&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-61" class="outline-3">
<h3 id="headline-61">
add-adv
</h3>
<div id="outline-text-headline-61" class="outline-text-3">
<p>Add advertising instance</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># add-adv [options] &lt;instance_id&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-62" class="outline-3">
<h3 id="headline-62">
rm-adv
</h3>
<div id="outline-text-headline-62" class="outline-text-3">
<p>Remove advertising instance</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># rm-adv &lt;instance_id&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-63" class="outline-3">
<h3 id="headline-63">
clr-adv
</h3>
<div id="outline-text-headline-63" class="outline-text-3">
<p>Clear advertising instances</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># clr-adv</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-64" class="outline-3">
<h3 id="headline-64">
add-ext-adv-params
</h3>
<div id="outline-text-headline-64" class="outline-text-3">
<p>Add extended advertising params</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># add-ext-adv-parms [options] &lt;instance_id&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-65" class="outline-3">
<h3 id="headline-65">
add-ext-adv-data
</h3>
<div id="outline-text-headline-65" class="outline-text-3">
<p>Add extended advertising data</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># add-ext-adv-data [options] &lt;instance_id&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-66" class="outline-3">
<h3 id="headline-66">
appearance
</h3>
<div id="outline-text-headline-66" class="outline-text-3">
<p>Set appearance</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># appearance &lt;appearance&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-67" class="outline-3">
<h3 id="headline-67">
phy
</h3>
<div id="outline-text-headline-67" class="outline-text-3">
<p>Get/Set PHY Configuration</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># phy [LE1MTX] [LE1MRX] [LE2MTX] [LE2MRX] [LECODEDTX]
[LECODEDRX]</strong> [BR1M1SLOT] [BR1M3SLOT] [BR1M5SLOT][EDR2M1SLOT]
[EDR2M3SLOT] [EDR2M5SLOT][EDR3M1SLOT] [EDR3M3SLOT] [EDR3M5SLOT]</dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-68" class="outline-3">
<h3 id="headline-68">
wbs
</h3>
<div id="outline-text-headline-68" class="outline-text-3">
<p>Toggle Wideband-Speech support</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># wbs &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-69" class="outline-3">
<h3 id="headline-69">
secinfo
</h3>
<div id="outline-text-headline-69" class="outline-text-3">
<p>Show security information</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># secinfo</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-70" class="outline-3">
<h3 id="headline-70">
expinfo
</h3>
<div id="outline-text-headline-70" class="outline-text-3">
<p>Show experimental features</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># expinfo</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-71" class="outline-3">
<h3 id="headline-71">
exp-debug
</h3>
<div id="outline-text-headline-71" class="outline-text-3">
<p>Set debug feature</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># exp-debug &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-72" class="outline-3">
<h3 id="headline-72">
exp-privacy
</h3>
<div id="outline-text-headline-72" class="outline-text-3">
<p>Set LL privacy feature</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># exp-privacy &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-73" class="outline-3">
<h3 id="headline-73">
exp-quality
</h3>
<div id="outline-text-headline-73" class="outline-text-3">
<p>Set bluetooth quality report feature</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># exp-quality &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
