content/man/man1/bluetoothctl-mgmt.1.org
** exp-offload
Toggle codec support

#+begin_quote
- *Usage* :: *# exp-offload <on/off>*

#+end_quote

** read-sysconfig
Read System Configuration

#+begin_quote
- *Usage* :: *# read-sysconfig*

#+end_quote

** set-sysconfig
Set System Configuration

#+begin_quote
- *Usage* :: *# set-sysconfig <-v|-h> [options...]*

#+end_quote

** get-flags
Get device flags

** set-flags
Set device flags

#+begin_quote
- *Usage* :: *# set-flags [-f flags] [-t type] <address>*

#+end_quote

* RESOURCES
<http://www.bluez.org>

* REPORTING BUGS
<linux-bluetooth@vger.kernel.org>

* COPYRIGHT
Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).
