public/man/man1/bluetoothctl-mgmt.1/index.html
<div id="outline-container-headline-74" class="outline-3">
<h3 id="headline-74">
exp-offload
</h3>
<div id="outline-text-headline-74" class="outline-text-3">
<p>Toggle codec support</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># exp-offload &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-75" class="outline-3">
<h3 id="headline-75">
read-sysconfig
</h3>
<div id="outline-text-headline-75" class="outline-text-3">
<p>Read System Configuration</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># read-sysconfig</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-76" class="outline-3">
<h3 id="headline-76">
set-sysconfig
</h3>
<div id="outline-text-headline-76" class="outline-text-3">
<p>Set System Configuration</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># set-sysconfig &lt;-v|-h&gt; [options…]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-77" class="outline-3">
<h3 id="headline-77">
get-flags
</h3>
<div id="outline-text-headline-77" class="outline-text-3">
<p>Get device flags</p>
</div>
</div>
<div id="outline-container-headline-78" class="outline-3">
<h3 id="headline-78">
set-flags
</h3>
<div id="outline-text-headline-78" class="outline-text-3">
<p>Set device flags</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># set-flags [-f flags] [-t type] &lt;address&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-79" class="outline-2">
<h2 id="headline-79">
RESOURCES
</h2>
<div id="outline-text-headline-79" class="outline-text-2">
<p>&lt;http://www.bluez.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-80" class="outline-2">
<h2 id="headline-80">
REPORTING BUGS
</h2>
<div id="outline-text-headline-80" class="outline-text-2">
<p>&lt;linux-bluetooth@vger.kernel.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-81" class="outline-2">
<h2 id="headline-81">
COPYRIGHT
</h2>
<div id="outline-text-headline-81" class="outline-text-2">
<p>Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
